# Pandas Basics

Pandas is used for data manipulation and analysis.

### Topics Covered
- Series & DataFrames
- Reading Data
- Indexing
- Cleaning Data
- GroupBy Operations

# Import & Series

In [1]:
import pandas as pd

s = pd.Series([10, 20, 30])
s

0    10
1    20
2    30
dtype: int64

# DataFrame

In [2]:
df = pd.DataFrame({
    "age": [25, 30, 35],
    "salary": [50000, 60000, 70000]
})

df

   age  salary
0   25   50000
1   30   60000
2   35   70000

# Indexing

In [3]:
df["age"]
df.iloc[0]

age          25
salary    50000
Name: 0, dtype: int64

# Boolean Filtering

In [4]:
df[df["salary"] > 55000]

   age  salary
1   30   60000
2   35   70000

# Handling Missing Values

In [5]:
df_missing = df.copy()
df_missing.loc[1, "salary"] = None

df_missing.fillna(df_missing.mean())

   age   salary
0   25  50000.0
1   30  60000.0
2   35  70000.0

# GroupBy

In [6]:
df["department"] = ["HR", "IT", "IT"]

df.groupby("department").mean()

             age   salary
department
HR          25.0  50000.0
IT          32.5  65000.0